# Demo: UPDATE, DELETE und TRUNCATE

Diese Demo bringt die Daten durcheinander. Erstellen Sie danach die Datenbank neu.

In [ ]:
USE NormalisierungsDemo;

In [ ]:
UPDATE Personal
SET Name = 'Doe', Vorname = 'Jane'; --Oops!

SELECT * FROM Personal;

In [ ]:
SELECT * FROM Tätigkeit;

UPDATE Tätigkeit
SET Stundenlohn *= 1.2
WHERE Tätigkeit = 'Bearbeitung';

SELECT * FROM Tätigkeit;

In [ ]:
UPDATE Tätigkeit
SET TätigkeitsNr = 99
WHERE Tätigkeit = 'Leitung'; -- Verletzung der referentiellen Integrität

In [ ]:
DELETE FROM Tätigkeit; -- Verletzung der referentiellen Integrität

In [ ]:
DELETE FROM Arbeitet_An
WHERE PersonalNr = (
    SELECT PersonalNr FROM Personal
    WHERE Vorname = 'Jane'
); -- Oops, es gibt mehrere Janes

In [ ]:
-- Abteilung 2 ohne Verletzung der Referentiellen Integrität löschen
DELETE FROM Arbeitet_An
WHERE PersonalNr IN (
    SELECT PersonalNr 
    FROM Personal
    WHERE AbtNr = 2
);

DELETE FROM Personal
WHERE AbtNr = 2;

DELETE FROM Abteilung
WHERE AbtNr = 2;

In [ ]:
TRUNCATE TABLE Tätigkeit; -- FK Verletzung

In [ ]:
DELETE FROM Arbeitet_An;

ALTER TABLE Arbeitet_An
DROP CONSTRAINT fk_ArbeitetAn_Tätigkeit;

TRUNCATE TABLE Tätigkeit;

## TRUNCATE Demo mit einer IDENTITY-Spalte

Hierfür legen wir eine neue Tabelle an...

In [ ]:
-- Neue Tabelle mit automatisch nummeriertem Primary Key
CREATE TABLE Inventar (
    InventarNr INT IDENTITY(1,1),
    Objekt VARCHAR(60) NOT NULL,
    CONSTRAINT pk_Inventar PRIMARY KEY(InventarNr)
);

In [ ]:
INSERT INTO Inventar (Objekt) -- Die Spalte InventarNr wird nicht angegeben!
VALUES ('Stuhl'),
    ('Tisch'),
    ('Kühlschrank'),
    ('Computer');

SELECT InventarNr, Objekt FROM Inventar; -- Das Inventar nummeriert sich durch.

In [ ]:
DELETE FROM Inventar;

INSERT INTO Inventar (Objekt)
VALUES ('Sofa'),
    ('Beistelltisch'),
    ('Fernseher');

SELECT InventarNr, Objekt FROM Inventar;  -- Nach DELETE entstehen Lücken im Zähler

In [ ]:
TRUNCATE TABLE Inventar;

INSERT INTO Inventar (Objekt)
VALUES ('PC'),
    ('Tastatur'),
    ('Maus'),
    ('Monitor');

SELECT InventarNr, Objekt FROM Inventar; -- Nach TRUNCATE ist IDENTITY zurückgesetzt.

In [ ]:
-- Aufräumen
DROP TABLE Inventar;